CREATE DATABASE  IF NOT EXISTS `sduonline_lantern_festival_2021` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `sduonline_lantern_festival_2021`;
-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: sduonline_lantern_festival_2021
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `answer_sheet`
--

DROP TABLE IF EXISTS `answer_sheet`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `answer_sheet` (
  `answer_sheet_id` int NOT NULL AUTO_INCREMENT,
  `riddle_list_id` int NOT NULL,
  `user_id` bigint NOT NULL,
  `answer1` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer2` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer3` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer4` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer5` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answer6` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `answered_num` int DEFAULT NULL COMMENT '本局回答了多少题',
  `correct_num` int DEFAULT NULL COMMENT '本局答对问题的数目。',
  `multiple` int DEFAULT NULL COMMENT '得分倍数。\r\n\n单人问卷：当错误答案数量<=2的时候为2倍，否则为1倍。\r\n多人问卷：胜者2倍，败者1倍。平局各1倍。',
  `score` int DEFAULT NULL COMMENT '本局得分，为倍数*答对的问题数。',
  PRIMARY KEY (`answer_sheet_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `answer_sheet`
--

LOCK TABLES `answer_sheet` WRITE;
/*!40000 ALTER TABLE `answer_sheet` DISABLE KEYS */;
/*!40000 ALTER TABLE `answer_sheet` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `riddle`
--

DROP TABLE IF EXISTS `riddle`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `riddle` (
  `riddle_id` int unsigned NOT NULL AUTO_INCREMENT,
  `content` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `tip` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `ans` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`riddle_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=601 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='元宵节灯谜题目表。元宵节灯谜英文应该是"lantern riddle"，这里省略了lantern。';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `riddle`
--

LOCK TABLES `riddle` WRITE;
/*!40000 ALTER TABLE `riddle` DISABLE KEYS */;
INSERT INTO `riddle` VALUES (1,'没有一日得安生','打一字','宴'),(2,'无奈之下去自首','打一字','关'),(3,'一去无音讯','打一字','查'),(4,'西施立花前','打一字','芳'),(5,'零下点点气温低','打一字','冷'),(6,'春末秋初花芬芳','打一字','香'),(7,'三方合作，善始善终','打一字','品'),(8,'进门方知是闯王','打一字','玛'),(9,'小桥流水几相逢','打一字','沉'),(10,'花草凋落叶参差','打一字','哗'),(11,'相识两月成知己','打一字','朋'),(12,'改变困境树雄心','打一字','保'),(13,'志士不取盗泉水','打一字','怕'),(14,'半生坎坷雄心在','打一字','佳'),(15,'迎风而立倍觉爽','打一字','飒'),(16,'一点可以推吉凶','打一字','卜'),(17,'秋后异乡闻钟声','打一字','终'),(18,'明月伴人游','打一字','胖'),(19,'可见天下无双','打一字','奇'),(20,'遥看宛如一剪梅','打一字','悔'),(21,'一上高位就忘本','打一字','未'),(22,'绝壁之上芳草疏','打一字','坊'),(23,'一入江东处处春','打一字','琳'),(24,'兵临西湖小河沟','打一字','浜'),(25,'残灯耳边更三声','打一字','耿'),(26,'一心改变旧面貌','打一字','恒'),(27,'闻声知是叶又落','打一字','吱'),(28,'了却心愿开小厂','打一字','白'),(29,'艇舟隐约，浊浪排空','打一字','蜓'),(30,'十字对十字，太阳对月亮','打一字','朝'),(31,'枕前芳心辗转','打一字','朴'),(32,'一边弯一边胀','打一字','张'),(33,'人举双手','打一字','火'),(34,'立着的木桩子','打一字','亲'),(35,'人在云端漫步','打一字','会'),(36,'半山半水','打一字','汕'),(37,'聚财有方','打一字','团'),(38,'官人竹下纳凉','打一字','管'),(39,'二人相依偎，青草底下栖','打一字','芙'),(40,'姜姑娘变成盆','打一字','盖'),(41,'缺斤少两','打一字','欣'),(42,'早不说晚不说','打一字','许'),(43,'进水行不成','打一字','衍'),(44,'上下一体','打一字','卡'),(45,'半导体','打一字','付'),(46,'熙熙攘攘','打一字','侈'),(47,'一一入史册','打一字','更'),(48,'两点天上来','打一字','关'),(49,'池塘亮底','打一字','汗'),(50,'弹丸之地','打一字','尘'),(51,'送走观音使不得','打一字','还'),(52,'入门无犬吠','打一字','问'),(53,'半耕半读','打一字','讲'),(54,'风头虎尾','打一字','几'),(55,'顶破天','打一字','夫'),(56,'后村闺中听风声','打一字','封'),(57,'女真侵宋分南北','打一字','案'),(58,'上诉无果','打一字','皓'),(59,'离别四十年，本聚在元宵','打一字','舞'),(60,'听得净是孩子声','打一字','竟'),(61,'开门日正中','打一字','间'),(62,'看颜色漂亮，见声音响亮','打一字','靓'),(63,'八尺见方','打一字','咫'),(64,'汪汪流水今犹在','打一字','琴'),(65,'中秋夜乌云密布','打一字','胞'),(66,'宝岛姑娘','打一字','始'),(67,'云破月来','打一字','育'),(68,'苗头不对','打一字','笛'),(69,'没顶之灾','打一字','火'),(70,'渭水一别月当空','打一字','田'),(71,'旭日东升','打一字','九'),(72,'一出头就长角','打一字','午'),(73,'流眼泪对流眼泪','打一字','器'),(74,'待到重阳日','打一字','晶'),(75,'家中兄长多，一门共八个。','打一字','阅'),(76,'一边是红，一边是绿，一边喜风，一边喜雨。','打一字','秋'),(77,'望每天兮天各一方','打一字','娱'),(78,'层峦叠翠春草生','打一字','茁'),(79,'弄瓦之喜','打一字','姓'),(80,'茶树之间除草木','打一字','人'),(81,'只是近黄昏','打一字','酱'),(82,'银楼','打一字','锯'),(83,'有雨放假无人来','打一字','霞'),(84,'三人在天上','打一字','奏'),(85,'视而不见','打一字','示'),(86,'有话大家讲','打一字','讼'),(87,'古时候的月亮','打一字','胡'),(88,'一个礼拜','打一字','旨'),(89,'真心相伴','打一字','慎'),(90,'人无信不立','打一字','言'),(91,'一大二小','打一字','奈'),(92,'镜中人','打一字','入'),(93,'借才生财','打一字','贝'),(94,'两人一般心','打一字','患'),(95,'半个月亮','打一字','胖'),(96,'自言自语','打一字','记'),(97,'森林大火','打一字','焚'),(98,'两颗小树','打一字','标'),(99,'木水火土皆是假','打一字','镇'),(100,'一口咬定','打一字','交'),(101,'点点是黄金','打一字','全'),(102,'八十八','打一字','米'),(103,'手足情深','打一字','捉'),(104,'一月七日','打一字','脂'),(105,'一口咬破衣','打一字','哀'),(106,'荧屏小姐','打一字','囡'),(107,'落花人独立，微雨燕双飞','打一字','俩'),(108,'我和太阳','打一字','晤'),(109,'春秋配','打一字','秦'),(110,'风儿吐舌头','打一字','刮'),(111,'水上工程','打一字','汞'),(112,'部位相反','打一字','陪'),(113,'两人陷在泥巴里','打一字','坐'),(114,'盲目行动','打一字','亡'),(115,'养猪专业户','打一字','阂'),(116,'一人腰上挂把弓','打一字','夷'),(117,'眼看田上长青草','打一字','瞄'),(118,'一人比两人高','打一字','众'),(119,'坐定左右无人','打一字','土'),(120,'学子远去，又见归来。','打一字','觉'),(121,'一家十一口','打一字','吉'),(122,'边打边谈','打一字','订'),(123,'闻不用耳','打一字','门'),(124,'虫入凤巢飞去鸟','打一字','风'),(125,'千言万语','打一字','够'),(126,'一日千里','打一字','量'),(127,'有目共睹','打一字','者'),(128,'半真半假','打一字','值'),(129,'田里雨后长青草','打一字','蕾'),(130,'日落相残却凡心一点','打一字','秃'),(131,'江边点起两盏灯火','打一字','淡'),(132,'有点骄傲','打一节气','小满'),(133,'桃园结义音已断','打一节气','立春'),(134,'一百减二','打一节气','白露'),(135,'雾散之后冰消融','打一节气','雨水'),(136,'人离位心别愁','打一节气','立秋'),(137,'雾中远山横，城头星点点。','打一节气','冬至'),(138,'相逢在雨下','打一节气','霜降'),(139,'后天举行半决赛','打一节气','大寒'),(140,'元迎探惜各西东','打一节气','春分'),(141,'音书两地隔，盼君一相逢。','打一节气','立春'),(142,'晴天一声雷，吓得蜜蜂把我追。','打一节气','惊蛰'),(143,'拆去图框','打一节气','冬至'),(144,'月光如注草萌发','打一节气','清明'),(145,'欲要前来，需先联系。','打一节气','谷雨'),(146,'雾中远山横，城头星点点。','打一节气','冬至'),(147,'天下无俗人','打一节气','谷雨'),(148,'害怕上当','打一节气','小寒'),(149,'自友一去容貌变','打一节气','夏至'),(150,'南京盛夏','打一节气','小暑'),(151,'上不怕水，下不怕火。家家厨房，都有一个。','打一生活用品','锅'),(152,'圆筒白浆糊，迟早挤一股。兄弟三十二，都说有好处。','打一生活用品','牙膏'),(153,'身体细长，兄弟成双，光爱吃菜，不爱喝汤。','打一生活用品','筷子'),(154,'白嫩小宝宝，洗澡吹泡泡，洗洗身体小，再洗不见了。','打一生活用品','香皂'),(155,'有面没有口，有脚没有手，虽有四只脚，自己不会走。','打一生活用品','桌子'),(156,'一朵花儿开得大，藤儿牵着高高挂，没有香味没有叶，会唱歌来会说话。','打一生活用品','喇叭'),(157,'两只小口袋，天天随身带，要是少一只，就把人笑坏。','打一生活用品','袜子'),(158,'独木造高楼，没瓦没砖头，人在水下走，水在人上流。','打一生活用品','雨伞'),(159,'稀奇稀奇真稀奇，拿人鼻子当马骑。','打一生活用品','眼镜'),(160,'滑溜溜，光亮亮，眼睛生在屁股上。','打一生活用品','针'),(161,'尖长嘴，铁刺骨，咬一口，走一步。','打一生活用品','剪刀'),(162,'有风不动无风动，不动无风动有风。','打一生活用品','扇子'),(163,'直直一条小红河，河水从来无浪波，天热水位就上涨，天冷必定往下落。','打一生活用品','温度计'),(164,'十个客人十间屋，冷了进去暖了出。','打一生活用品','手套'),(165,'外麻里光，住在闺房。姑娘怕戳疼，拿它来抵挡。','打一生活用品','顶针'),(166,'口比肚子大，给啥就吃啥。它吃为了你，你吃端着它。','打一生活用品','碗'),(167,'前面来只船，舵手在上边。来时下小雨，走后路已干。','打一生活用品','熨斗'),(168,'一队胡子兵，当了牙医生。早晚来巡逻，打扫真干净。','打一生活用品','牙刷'),(169,'生在鸡家湾，嫁到竹家滩。向来爱干净，常逛灰家山。','打一生活用品','鸡毛掸'),(170,'一藤连万家，家家挂只瓜。瓜儿长不大，夜夜会开花。','打一生活用品','电灯'),(171,'有硬有软，有长有宽。白天空闲，夜晚上班。','打一生活用品','床'),(172,'又白又软，罩住人脸。守住关口，防止传染。','打一生活用品','口罩'),(173,'一只黑狗，两头开口。一头咬煤，一头咬手。','打一生活用品','火钳'),(174,'猛将百余人，无事不出城。出城就放火，引火自烧身。','打一生活用品','火柴'),(175,'一只没脚鸡，立着从不啼。吃水不吃米，客来敬个礼。','打一生活用品','茶壶'),(176,'站着百分高，躺着十寸长。裁衣做数学，它会帮你忙','打一生活用品','尺'),(177,'楼台接楼台，层层叠起来。上面飘白雾，下面水花开。','打一生活用品','蒸笼'),(178,'出差一年','打一成语','满载而归'),(179,'小巷偶遇','打一成语','狭路相逢'),(180,'见多识广，永无烦恼','打一成语','知足常乐'),(181,'幽王戏诸侯，纣王烧鹿台','打一成语','玩火自焚'),(182,'杜鹃啼时杜鹃红','打一成语','有声有色'),(183,'未弄清楚莫表态','打一成语','不明不白'),(184,'肚子挺起心头火','打一成语','一鼓作气'),(185,'硬抵着头皮撞','打一成语','首当其冲'),(186,'剃头师傅开口，三句不离本行','打一成语','言之有理'),(187,'捡到东西要交公','打一成语','不可收拾'),(188,'听到错误就要说','打一成语','闻过则喜'),(189,'只身离家赴官场','打一成语','一行作吏'),(190,'万贯家财话当年','打一成语','有言在先'),(191,'刷墙工夫好','打一成语','粉饰太平'),(192,'童话剧','打一成语','视同儿戏'),(193,'出门便得惹祸端','打一成语','在所难免'),(194,'跳槽已司空见惯','打一成语','少不更事'),(195,'单骑征蜀中','打一成语','一马平川'),(196,'不顾南北','打一成语','东张西望'),(197,'豹子头误入白虎堂','打一成语','冲锋陷阵'),(198,'美滋滋不知家在哪','打一成语','得意门生'),(199,'火把接力传递','打一成语','付之一炬'),(200,'初当轿夫活儿生','打一成语','不识抬举'),(201,'两心上下总难平','打一成语','忐忑不安'),(202,'老邻居','打一成语','隔墙有耳'),(203,'移干柴近烈火','打一成语','理所当然'),(204,'路尽言未尽','打一成语','说长道短'),(205,'五彩云霞空中飘','打一成语','天真烂漫'),(206,'女娲练石','打一成语','天作之合'),(207,'眼前唯有天地存','打一成语','目中无人'),(208,'岩上岩下有人也','打一成语','他山之石'),(209,'成方圆之路','打一成语','规行矩步'),(210,'合心','打一成语','恰如其分'),(211,'金乌西坠，玉兔东升','打一成语','夜以继日'),(212,'双方都是门外汉','打一成语','格格不入'),(213,'莫辞更坐弹一曲','打一成语','令人发指'),(214,'沿途尽扫禄山兵','打一成语','一路平安'),(215,'清明过后抽新条','打一成语','节外生枝'),(216,'反复朗读记得牢','打一成语','念念不忘'),(217,'说话和气','打一成语','风言风语'),(218,'不负中秋夜明月','打一成语','胜利在望'),(219,'日入而作，日出而息','打一成语','颠倒黑白'),(220,'天天躲山洞，夜晚出来唧唧叫，从不做亏心事。','打一动物','蝙蝠'),(221,'身穿白大褂，长着红嘴巴，替你把信捎，准时又可靠。','打一动物','信鸽'),(222,'尖尖牙齿大大嘴，长长尾巴短短腿。捕捉猎物流眼泪，可惜那是假慈悲。','打一动物','鳄鱼'),(223,'说它是虎它不像，金钱印在黄袄上，站在山上吼一声，吓跑猴子吓跑狼。','打一动物','金钱豹'),(224,'嘴像小铲子，脚像小扇子，走路左右摆，水上划船子。','打一动物','鸭子'),(225,'身穿花皮袄，山上到处跑。人称百兽王，凶猛脾气暴。','打一动物','老虎'),(226,'两角弯弯像香蕉，身上长着白卷毛。浑身是宝贡献大，最爱吃的是青草。','打一动物','绵羊'),(227,'一个医生嘴巴尖，天天出诊去林间。这敲敲，那听听，要动手术把头点。','打一动物','啄木鸟'),(228,'为你打我，为我打你。打到你皮开，打得我出血。','打一动物','蚊子'),(229,'白天草丛呆，夜晚空中游。一盏小灯笼，挂在身后头。','打一动物','萤火虫'),(230,'会飞不是鸟，总在树上叫。夸口全知道，其实不知道。','打一动物','蝉'),(231,'身子像个小逗点，摇着一根小尾巴，从小就会吃孑孓，长大吃虫叫哇哇。','打一动物','蝌蚪'),(232,'头戴红帽子，身穿白袍子。走路摆架子，说话伸脖子。','打一动物','鹅'),(233,'家住美丽大森林，擅长爬树动作灵。行动像人最聪明，喜怒哀乐有表情。','打一动物','猩猩'),(234,'八只脚，抬面鼓，两把剪刀鼓前舞，生来横行又霸道，嘴里常把泡沫吐。','打一动物','螃蟹'),(235,'鼻子像钩子，耳朵像扇子，大腿像柱子，尾巴像辫子。','打一动物','大象'),(236,'头顶两只角，身背一只镬。只怕晒太阳，不怕大雨落。','打一动物','蜗牛'),(237,'说马不像马，路上没有它。若用它做药，要到海中抓。','打一动物','海马'),(238,'无脚也无手，身穿鸡皮皱。谁若碰着它，吓得连忙走。','打一动物','蛇'),(239,'头插花翎翅，身穿彩旗袍。终日到处游，只知乐逍遥。','打一动物','蝴蝶'),(240,'背板过海，满腹文章。从无偷窃行为，为何贼名远扬？','打一动物','乌贼'),(241,'日飞落树上，夜晚到庙堂。不要看我小，有心肺肝肠。','打一动物','麻雀'),(242,'你坐我不坐，我行你不行。你睡躺得平，我睡站到明。','打一动物','马'),(243,'脚着暖底靴，口边出胡须。夜里当巡捕，日里把眼眯。','打一动物','猫'),(244,'头前两把刀，钻地害禾苗。捕来烘成干，一味利尿药。','打一动物','蝼蛄'),(245,'四柱八栏杆，住着懒惰汉。鼻子团团转，尾巴打个圈。','打一动物','猪'),(246,'生的是一碗，煮熟是一碗。不吃是一碗，吃了也一碗。','打一动物','田螺'),(247,'头戴周瑜帽，身穿张飞袍。自称孙伯符，脾气像马超。','打一动物','蟋蟀'),(248,'身穿绿衣裳，肩扛两把刀。庄稼地里走，害虫吓得跑。','打一动物','螳螂'),(249,'说它是头牛，不会拉犁头，说它力气小，背着屋子走。','打一动物','蜗牛'),(250,'凌罗绸缎身上穿，头插鲜花摆翩翩，站在墙头一声唤，满天星星全下班。','打一动物','公鸡'),(251,'灰黑身子细长尾，贼头贼脑尖尖嘴，夜里出来偷东西，见了猫儿如见鬼。','打一动物','老鼠'),(252,'身披灰针毯，常往瓜地窜，遇到敌人来，立即蜷成团。','打一动物','刺猬'),(253,'花冠头上戴，锦袍真不赖，尾巴似扇子，展开人人爱。','打一动物','孔雀'),(254,'远望满地是芝麻，近睢一群小黑马，不怕高山与陡坡，就怕热锅上面爬。','打一动物','蚂蚁'),(255,'手像脚来脚像手，屁股红来脸儿丑，动作表情挺像人，爬杆上树是能手。','打一动物','猴子'),(256,'别人皮包骨，我却骨包皮，别人用脚走，我却用头移。','打一动物','田螺'),(257,'头上两根树杈，身开白色梅花，性情最是温顺，跑步赛过骏马','打一动物','梅花鹿'),(258,'五官生得不像样，眼睛红来耳朵长，鼻塌嘴豁尾巴短，后腿却比前腿长','打一动物','兔子'),(259,'背上背着一座山，身体长得笨又圆，大海深处去游泳，沙滩上面来生蛋。','打一动物','海龟'),(260,'头像绵羊颈像鹅，也非牛马也非螺，吃尽辛苦行千里，能耐渴来能忍饿。','打一动物','骆驼'),(261,'一棵小树刺满身，体态好像巴掌伸，原本住在沙窝里，如今盆栽四季青。','打一植物','仙人掌'),(262,'小小花儿价最高，八月中秋香气飘，吴刚用它酿好酒，人间用它做糖糕。','打一植物','桂花'),(263,'青枝绿叶一树桃，外长骨头里长毛，有朝一日桃子熟，里长骨头外长毛。','打一植物','棉花'),(264,'身受千刀万剐，层层衣服剥下，留得刀痕遍体，依然满头青发。','打一植物','棕榈'),(265,'三片瓦，盖座庙，里面坐个白老道。','打一植物','荞麦'),(266,'一棵树高赛大楼，春季花开满枝头，花落结出豆荚果，可以用来洗丝绸。','打一植物','皂角树'),(267,'淡妆小娇娘，粉红色面庞，妩媚又动人，坐在水中央。','打一植物','荷花'),(268,'一把小红伞，插在绿叶间，风吹婀娜态，左顾又右盼。','打一植物','虞美人'),(269,'青草结成一间屋，兄弟十五六，自小分房各自宿。','打一植物','莲蓬'),(270,'一个小姑娘，长满路头发，雨给他洗头，风给他吹发。','打一植物','柳树'),(271,'一个孩子真俊俏，衣裳穿了七八套，怀里藏着珍珠宝，头上戴着红缨帽。','打一农作物','玉米'),(272,'一根苗儿直到梢，开出花来节节高，人人说它有福气，老来还挨棒头敲。','打一农作物','芝麻'),(273,'白白胖胖小宝宝，一生长在泥窝中，年纪不大心眼多，清脆爽口丝相连。','打一农作物','藕'),(274,'青竹竿，顶簸箕，下面躲着麻母鸡。','打一农作物','芋头'),(275,'枝上结个桃，头尖不长毛，小时穿绿袄，老了换红袍。','打一农作物','辣椒'),(276,'有根无土栽，有叶无花开，有人买去吃，无人买去栽。','打一农作物','豆芽'),(277,'兄弟七八个，围着旗杆坐，脱下白绸袍，等着盐大哥。','打一农作物','大蒜'),(278,'皱皱眠床朱红被，雪白小官人困在里。','打一农作物','花生'),(279,'红面子，白夹里，小辫子，笔笔直。','打一农作物','萝卜'),(280,'桃李开花脚踏泥，出水荷花头戴珠，身穿茅草百节衣，皇帝无我不登基。','打一农作物','水稻'),(281,'身上有节不是竹，粗的能有锄把粗。小孩抓住啃不够，老人没牙干叫苦。','打一水果','甘蔗'),(282,'黄外衣，点黑豆，尝一只，甜水流。','打一水果','梨'),(283,'红麻帐，，白麻帐，里面坐着黑和尚。','打一水果','荔枝'),(284,'身披黄金甲，香味直冲天，有人喜欢它，有人讨厌它。','打一水果','榴莲'),(285,'一个小胖子，藏着黑珠子，剥开黄身子，露出白肚子。','打一水果','龙眼'),(286,'小小灯笼红彤彤，白白珍珠里面藏。轻轻掀开白纱帐，胖胖饺子甜心头。','打一水果','橘子'),(287,'红红圆圆皮肤好，一口咬下脆脆甜味。','打一水果','苹果'),(288,'金格橱，银格橱，格格橱里放珍珠。','打一水果','石榴'),(289,'身披鱼鳞铠甲，长着公鸡尾巴。动物家族无名，水果店里有它。','打一水果','菠萝'),(290,'一棵藤儿弯又弯，上面满是珍珠串。有紫有绿真好看，生的酸来熟的甜。','打一水果','葡萄'),(291,'红坛子，口儿小。打开来，粒粒像珠宝。','打一水果','石榴'),(292,'身穿绿衣裳，肚里水汪汪。生的儿子多，个个黑脸膛。','打一水果','西瓜'),(293,'体圆似球，色红如血，皮亮如珠，汁甜赛蜜。','打一水果','樱桃'),(294,'高高树上结果实，插入吸管尽情饮。','打一水果','椰子'),(295,'小时绷着青脸皮，老来皱起红脸皮，生的熟吃惹人笑，熟的生吃不稀奇。','打一水果','枣'),(296,'远看红脸好相貌，近看一脸红疙瘩。虽说样儿小又小，为人解渴本领大。','打一水果','杨梅'),(297,'长得又高又大，大球头上悬挂，球外棉衣裹身，只在南方安家。','打一水果','椰子'),(298,'小龙船，龙船小，龙船尖尖两角翘，水里飘了一秋天，装来一颗白元宝。','打一水果','菱角'),(299,'几个兄弟一个样，弯弯身子软心肠。看看个个像弯月，吃在嘴里甜又香。','打一水果','香蕉'),(300,'胖娃娃，没手脚，红尖嘴，一身毛，背上一道沟，肚里好味道。','打一水果','桃子'),(301,'年终岁尾，不缺鱼米。','打一字','鳞'),(302,'除夕夜守岁。','打一歇后语','辞旧迎新'),(303,'红公鸡，绿尾巴，身体钻到地底下，又甜又脆营养大。','打一食物','红萝卜'),(304,'弟兄五六个，围着圆柱坐，大家一分手，衣服都扯破。','打一食物','大蒜'),(305,'身体白又胖，常在泥中藏，浑身是蜂窝，生熟都能尝。','打一食物','藕'),(306,'有洞不见虫，有巢不见峰，有丝不见蚕，撑伞不见人。','打一食物','藕'),(307,'圆圆脸儿像苹果，又酸又甜营养多，既能做菜吃，又可当水果。','打一食物','蕃茄'),(308,'白又方，嫩又香，能做菜，能煮汤，豆子是它爹和妈，它和爹妈不一样。','打一食物','豆腐'),(309,'一','打一成语','接二连三'),(310,'无底洞','打一成语','深不可测'),(311,'飞行员','打一成语','有机可乘'),(312,'笑死人','打一成语','乐极生悲'),(313,'举重比赛','打一成语','斤斤计较'),(314,'愚公之家','打一成语','开门见山'),(315,'盲人摸象','打一成语','不识大体'),(316,'清浊合流','打一成语','泾渭不分'),(317,'双手赞成','打一成语','多此一举'),(318,'蜜饯黄连','打一成语','同甘共苦'),(319,'武大郎设宴','打一成语','高朋满座'),(320,'千里通电话','打一成语','遥相呼应'),(321,'不考虑中间','打一成语','瞻前顾后'),(322,'没关水龙头','打一成语','放任自流'),(323,'快刀斩乱麻','打一成语','迎刃而解'),(324,'一块变九块','打一成语','四分五裂'),(325,'鲁达当和尚','打一成语','半路出家'),(326,'哑巴打手势','打一成语','不言而喻'),(327,'娄阿鼠问卦','打一成语','做贼心虚'),(328,'超级好牙刷','打一成语','一毛不拔'),(329,'猫狗像什么','打一成语','如狼似虎'),(330,'最荒凉的地方','打一成语','寸草不生'),(331,'最反常的天气','打一成语','冬暖夏凉'),(332,'武','打一字','斐'),(333,'血盆','打一字','唬'),(334,'书签','打一字','颊'),(335,'丰收','打一字','移'),(336,'抽水泵','打一字','石'),(337,'半导体','打一字','付'),(338,'顶破天','打一字','夫'),(339,'画中人','打一字','佃'),(340,'池塘亮底','打一字','汗'),(341,'半耕半读','打一字','讲'),(342,'熙熙攘攘','打一字','侈'),(343,'内里有人','打一字','肉'),(344,'上下一体','打一字','卡'),(345,'入门无犬吠','打一字','问'),(346,'进水行不成','打一字','衍'),(347,'两点天上来','打一字','关'),(348,'早不说晚不说','打一字','许'),(349,'乖','打一成语','乘人不备'),(350,'仙乐','打一成语','不同凡响'),(351,'美梦','打一成语','好景不长'),(352,'无底洞','打一成语','深不可测'),(353,'脱粒机','打一成语','吞吞吐吐'),(354,'翘翘板','打一成语','此起彼落'),(355,'纸老虎','打一成语','外强中干'),(356,'举重比赛','打一成语','斤斤计较'),(357,'盲人摸象','打一成语','不识大体'),(358,'蜜饯黄连','打一成语','同甘共苦'),(359,'快刀斩乱麻','打一成语','迎刃而解'),(360,'鲁达当和尚','打一成语','半路出家'),(361,'一块变九块','打一成语','四分五裂'),(362,'哑巴打手势','打一成语','不言而喻'),(363,'遇事不求人','打一成语','自力更生'),(364,'耳朵长，尾巴短。只吃菜，不吃饭。','打一动物名','兔子'),(365,'粽子脸，梅花脚。前面喊叫，后面舞刀。','打一动物名','狗'),(366,'小姑娘，夜纳凉。带灯笼，闪闪亮。','打一动物名','萤火虫'),(367,'一支香，地里钻。弯身走，不会断。','打一动物名','蚯蚓'),(368,'一样物，花花绿。扑下台，跳上屋。','打一动物名','猫'),(369,'沟里走，沟里串。背了针，忘了线。','打一动物名','刺猬'),(370,'船板硬，船面高。四把桨，慢慢摇。','打一动物名','乌龟'),(371,'一把刀，顺水漂。有眼睛，没眉毛。','打一动物名','鱼'),(372,'一星星，一点点。走大路，钻小洞。','打一动物名','蚂蚁'),(373,'小小船，白布篷。头也红，桨也红。','打一动物名','鹅'),(374,'娘子娘子，身似盒子。麒麟剪刀，八个钗子。','打一动物名','蟹'),(375,'进洞像龙，出洞像凤。凤生百子，百子成龙。','打一动物名','蚕'),(376,'尖尖长嘴，细细小腿。拖条大尾，疑神疑鬼。','打一动物名','狐狸'),(377,'为你打我，为我打你。打到你皮开，打得我出血。','打一动物名','蚊子'),(378,'无脚也无手，身穿鸡皮皱。谁若碰着它，吓得连忙走。','打一动物名','蛇'),(379,'日飞落树上，夜晚到庙堂。不要看我小，有心肺肝肠。','打一动物名','麻雀'),(380,'说马不像马，路上没有它。若用它做药，要到海中抓。','打一动物名','海马'),(381,'小时像逗号，在水中玩耍。长大跳得高，是捉虫冠军。','打一动物名','青蛙'),(382,'有位小姑娘，身穿黄衣裳。谁要欺负她，她就戳一枪。','打一动物名','黄蜂'),(383,'身小力不小，团结又勤劳。有时搬粮食，有时挖地道。','打一动物名','蚂蚁'),(384,'穿着大红袍，头戴铁甲帽。叫叫我阿公，捉捉我不牢。','打一动物名','蜈蚣'),(385,'沙漠一只船，船上载大山。远看像笔架，近看一身毡。','打一动物名','骆驼'),(386,'头胖脚掌大，像个大傻瓜。四肢短又粗，爱穿黑大褂。','打一动物名','熊'),(387,'个儿高又大，脖子似吊塔。和气又善良，从来不打架。','打一动物名','长颈鹿'),(388,'鼻子像钩子，耳朵像扇子。大腿像柱子，尾巴像鞭子。','打一动物名','象'),(389,'远看像黄球，近看毛茸茸。叽叽叽叽叫，最爱吃小虫。','打一动物名','小鸡'),(390,'兄弟七八千，住在屋檐边。日日做浆卖，浆汁更值钱。','打一动物名','蜂'),(391,'身上滑腻腻，喜欢钻河底。张嘴吐泡泡，可以测天气。','打一动物名','泥鳅'),(392,'像鱼不是鱼，终生住海里。远看是喷泉，近看像岛屿。','打一动物名','鲸'),(393,'黑脸包丞相，坐在大堂上。扯起八卦旗，专拿飞天将。','打一动物名','蜘蛛'),(394,'驼背老公公，胡子乱蓬蓬。生前没有血，死后满身红。','打一动物名','虾'),(395,'像猫不是猫，身穿皮袄花。山中称霸王，寅年它当家。','打一动物名','老虎'),(396,'头插花翎翅，身穿彩旗袍。终日到处游，只知乐逍遥。','打一动物名','蝴蝶'),(397,'四柱八栏杆，住着懒惰汉。鼻子团团转，尾巴打个圈。','打一动物名','猪'),(398,'生的是一碗，煮熟是一碗。不吃是一碗，吃了也一碗。','打一动物名','田螺'),(399,'叫猫不抓鼠，像熊爱吃竹。摇摆惹人爱，是猫还是熊?','打一动物名','熊猫'),(400,'仙乐','打一成语','不同凡响'),(401,'卧倒','打一成语','五体投地'),(402,'显微镜','打一成语','一孔之见'),(403,'垃圾箱','打一成语','藏污纳垢'),(404,'《聊斋志异》','打一成语','鬼话连篇'),(405,'牛两头','打一字','生'),(406,'牛年进财','打一字','钮'),(407,'牵牛过堂下','打一字','牡'),(408,'日解一牛','打一字','星'),(409,'阶前有鸟迹','打一成语','门可罗雀'),(410,'爬楼梯。','打一成语','步步高升'),(411,'仲尼日月也。','打一成语','一孔之见'),(412,'五句话。','打一成语','三言两语'),(413,'心无二用。','打一成语','一心一意'),(414,'弹丸之地','打一字','尘'),(415,'凤头虎尾','打一字)','几'),(416,'固若金汤','打河北一地名','保定'),(417,'上下四方都无险','安徽地名','六安'),(418,'刘关张结义地址','打台湾一地名','桃园'),(419,'全面整顿','打云南一地名','大理'),(420,'十人九死','打一中药名','独活'),(421,'金钿遍野','打一中草药名','地黄'),(422,'妇女节前夕','打一中草药','三七'),(423,'古城姐妹','打一中草药名','金银花'),(424,'马嵬坡下泥土中','打一外国影片或游戏名','古墓丽影'),(425,'扶桑已在飘渺中','打一外国影片','日本沉没'),(426,'到了长城放声唱','打一歌名','好汉歌'),(427,'天涯海角','打一歌曲名','在那遥远的地方'),(428,'醒后得知一场梦','打《西游记》人名','悟空'),(429,'左手五个，左手五个。拿去十个，还剩十个','打一日常用品','手套'),(430,'四角方方，常随常往。伤风咳嗽，数它最忙','打一日常用品','手帕'),(431,'半个西瓜样，口朝上面搁。上头不怕水，下头不怕火','打一日常用品','锅'),(432,'中间是火山，四边是大海。海里宝贝多，快快捞上来','打一日常用品','火锅'),(433,'红娘子，上高楼，心里疼，眼泪流','打一日常用品名','蜡烛'),(434,'猛将百余人，无事不出城。出城就放火，引火自烧身','打一日常用品','火柴'),(435,'一只八宝袋，样样都能装。能装棉和纱，能装铁和钢','打一日常用品','针线包'),(436,'远看两个零，近看两个零。有人用了行不得，有人不用不得行','打一日常用品','眼镜'),(437,'有面无口，有脚无手。听人讲话，陪人吃酒','打一日常用品','桌子'),(438,'带着平顶帽，身穿圆筒袄，虽然一只眼，暗中逞英豪','打一日常用品','手电筒'),(439,'小小东西，放在腋底。有病没病，看它肚皮','打一日常用品','温度计'),(440,'金钩吊银圈，姐妹隔座山。若要来相会，需到天色晚','打一日常用品','耳环'),(441,'外面冷冰冰，里面热心肠，一夜到天亮，肚里还不凉','打一日常用品','暖壶'),(442,'有硬有软，有长有宽。白天空闲，夜晚上班','打一日常用品','床'),(443,'有风吹不动，它动就生风，若要不动它，待到起秋风','打一日常用品','扇子'),(444,'一间小药房，药品里面藏。房子涂白色，十字画中央','打一日常用品','医药箱'),(445,'一物生得巧，地位比人高。戴上御风寒，脱下有礼貌','打一日常用品','帽子'),(446,'屋里一座亭，亭中有个人，天天荡秋千，不荡就有病','打一日常用品','钟摆'),(447,'不是点心不是糖,软软凉凉肚里藏,不能吃来不能喝,每天也要尝一尝','打一日常用品','牙膏'),(448,'红艳艳，飘胸前。像火苗，暖心间','打一日常用品','红领巾'),(449,'口比肚子大，给啥就吃啥。它吃为了你，你吃端着它','打一日常用品','饭碗'),(450,'楼台接楼台，一层一层接起来，上面冒白气，下面水开花','打一日常用品','蒸笼'),(451,'皇','打一成语','白玉无暇'),(452,'八十八','打一字','米'),(453,'吃尽苦头','打一字','古'),(454,'山上还有山','打一字','出'),(455,'家中添一口','打一字','豪'),(456,'十张口,一颗心','打一字','思'),(457,'一只黑狗,不叫不吼','打一字','默'),(458,'一人一张口,下面长只手','打一字','拿'),(459,'守门员','打一字','闪'),(460,'打断念头','打一字','心'),(461,'一点水准','打一字','淮'),(462,'综合门市','打一字','闹'),(463,'一月一日非今天','打一字','明'),(464,'需要一半,留下一半','打一字','雷'),(465,'存心不让出大门,你说烦人不烦人','打一字','闷'),(466,'一只狗,两个口,谁遇见它谁发愁','打一字','哭'),(467,'一斗米','打一字','料'),(468,'半青半紫','打一字','素'),(469,'大得出奇','打一字','可'),(470,'一大二小','打一字','奈'),(471,'二人走钢丝','打一字','丛'),(472,'一加一','打一字','王'),(473,'瓜熟蒂落','打一字','爪'),(474,'一百减','打一字','白'),(475,'昏头昏脑','打一字','氏'),(476,'节约动力','打一字','云'),(477,'尽是缺点','打一字','尺'),(478,'一只狗四个口','打一字','器'),(479,'一个人搬两个土','打一字','佳'),(480,'九号','打一字','白'),(481,'九辆车','打一字','轨'),(482,'久雷不雨','打一字','田'),(483,'人不在其位','打一字','立'),(484,'人有他则变大','打一字','一'),(485,'七人头上长了草','打一字','花'),(486,'马前泼水,一点难收','打一字','冯'),(487,'反比','打一字','北'),(488,'天天','打一字','晦'),(489,'泼水节','打一字','发'),(490,'千古共存','打一字','舌'),(491,'去掉一竖','打一字','云'),(492,'人人立正','打一字','征'),(493,'门内无犬吠','打一字','问'),(494,'十二点','打一字','斗'),(495,'十个哥哥','打一字','兄'),(496,'人人让座','打一字','庄'),(497,'十月十日','打一字','朝'),(498,'雨落在横山上','打一字','雪'),(499,'人要闯,马要放','打一字','闪'),(500,'手提包','打一字','抱'),(501,'兄有债','打一字','歌'),(502,'半个人','打一字','伴'),(503,'文武双全','打一字','斌'),(504,'日复一日','打一字','昌'),(505,'水上工程','打一字','汞'),(506,'心如刀刺','打一字','必'),(507,'半真半假','打一字','值'),(508,'太阳西边下,月儿东边挂','打一字','明'),(509,'田中','打一字','十'),(510,'多一半','打一字','夕'),(511,'三岔口','打一字','品'),(512,'森林大火','打一字','焚'),(513,'日进一尺','打一字','昼'),(514,'旭日东升','打一字','九'),(515,'入秋火气消','打一字','禾'),(516,'你是有心人','打一字','您'),(517,'古时候的月亮','打一字','胡'),(518,'女的没白来','打一字','妁'),(519,'十二点来烧火','打一字','炷'),(520,'多半要反目','打一字','罗'),(521,'挑人请不要动手','打一字','佻'),(522,'有心吃羊腿','打一字','恙'),(523,'想走之后掉眼泪','打一字','湘'),(524,'挑弄一下抱一下','打一字','卉'),(525,'除掉小人就上山','打一字','陆'),(526,'上下奔走为高升','打一字','千'),(527,'解穴就由后生来','打一字','寅'),(528,'土豪离家乘舟游','打一字','逞'),(529,'醉后没法去开会','打一字','酒'),(530,'天天晚上喊医生','打一字','一'),(531,'灯火暗淡亮几无','打一字','亭'),(532,'早日出发叹别离','打一字','吱'),(533,'言语轻佻','打一广东地名','云浮'),(534,'冰雪融化','打一地名','开封'),(535,'圆规画鸡蛋','打一地名','太原'),(536,'荧火虫','打一地名','昆明'),(537,'胖子开会','打一地名','合肥'),(538,'大家都笑你','打一地名','齐齐哈尔'),(539,'一路平安','打一地名','旅顺'),(540,'千里戈壁','打一地名','长沙'),(541,'四季花开','打一地名','长春'),(542,'海上绿洲','打一地名','青岛'),(543,'全面整顿','打一地名','大理'),(544,'背景分明','打一地名','北京'),(545,'一寸光阴一寸金','打一地名','贵阳'),(546,'巨轮出海','打一地名','杭州'),(547,'风平浪静','打一地名','宁波'),(548,'金银铜铁','打一地名','无锡'),(549,'空中码头','打一地名','连云港'),(550,'夸夸其谈','打一地名','海口'),(551,'见脸不见发','打一地名','包头'),(552,'永久太平','打一地名','长安'),(553,'蓝色之洋','打一地名','青海'),(554,'东方有战乱','打一地名','西安'),(555,'相差无几','打一地名','大同'),(556,'红色的山','打一地名','赤锋'),(557,'不冷不热的地方','打一地名','温州'),(558,'觉醒了的大地','打一地名','苏州'),(559,'烽火堡','打一地名','烟台'),(560,'沃野千里','打一地名','平壤'),(561,'良材','打一地名','佳木斯'),(562,'雪盖冰河','打一地名','银川'),(563,'花满海湾','打一地名','香港'),(564,'宝树丛丛','打一地名','吉林'),(565,'羊上法庭','打一地名','沈阳'),(566,'拿枪的兵','打一地名','武汉'),(567,'东南北','打一地名','西藏'),(568,'有人无人都是你','打一字','尔'),(569,'七仙女嫁出去一个','打一成语','六神无主'),(570,'上上下下，不上不下','猜一字','卡'),(571,'长河落日圆','猜一成语','风平浪静'),(572,'天涯何处无芳草','打一成语','不毛之地'),(573,'元旦元宵捷报频传','打一成语','节节胜利'),(574,'所有的王八穿龙袍','打一电影','满城尽带黄金甲'),(575,'看望昔日同窗','打一明星','张学友'),(576,'聊斋','打一歌名','死了都要爱'),(577,'懒惰的蜘蛛','打一成语','一丝不挂'),(578,'皇帝新衣','打一字','袭'),(579,'一流水准','打一字','准'),(580,'石达开','打一字','研'),(581,'格外大方','打一字','回'),(582,'走出深闺人结识','打一字','佳'),(583,'一千零一夜','打一字','歼'),(584,'七十二小时','打一字','晶'),(585,'一口咬住多半截','打一字','名'),(586,'要一半，扔一半','打一字','奶'),(587,'综合门市','打一字','闹'),(588,'上气接下气','打一字','乞'),(589,'四方来合作，贡献大一点','打一字','器'),(590,'贪前稍变就成穷','打一字','贫'),(591,'半布春秋','打一字','秦'),(592,'银川','打一字','泉'),(593,'一来再来','打一字','冉'),(594,'有人偷车','打一字','输'),(595,'酿酒之后隔日香','打一字','晒'),(596,'自己','打一字','体'),(597,'秀才翘尾巴','打一字','秃'),(598,'身残心不残','打一字','息'),(599,'十八乘六','打一字','校'),(600,'八字头','打一字','学');
/*!40000 ALTER TABLE `riddle` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `riddle_list`
--

DROP TABLE IF EXISTS `riddle_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `riddle_list` (
  `riddle_list_id` int NOT NULL AUTO_INCREMENT,
  `room_id` int NOT NULL,
  `riddle1_id` int NOT NULL,
  `riddle2_id` int NOT NULL,
  `riddle3_id` int NOT NULL,
  `riddle4_id` int NOT NULL,
  `riddle5_id` int NOT NULL,
  `riddle6_id` int NOT NULL,
  PRIMARY KEY (`riddle_list_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='闯关/pk的答卷部分（一个房间可能有多个问卷）。';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `riddle_list`
--

LOCK TABLES `riddle_list` WRITE;
/*!40000 ALTER TABLE `riddle_list` DISABLE KEYS */;
/*!40000 ALTER TABLE `riddle_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `room`
--

DROP TABLE IF EXISTS `room`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `room` (
  `room_id` int NOT NULL,
  `room_capacity` tinyint DEFAULT NULL COMMENT '房间容量（1或2）。',
  `user1_id` bigint DEFAULT NULL COMMENT '房间内的用户的id，优先填充1，然后才填充2。',
  `user2_id` bigint DEFAULT NULL,
  `room_end_state` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '房间结束时的状态。',
  `room_end_reason` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  PRIMARY KEY (`room_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='单人/双人对战房间（房间可以有多个问卷）。';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `room`
--

LOCK TABLES `room` WRITE;
/*!40000 ALTER TABLE `room` DISABLE KEYS */;
/*!40000 ALTER TABLE `room` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `user_id` bigint NOT NULL COMMENT '用户的学/工号，注意由于学/工号太长，所以这里用的是BIGINT。',
  `nickname` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `create_time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC COMMENT='用户信息表。注意由于学/工号太长，user_id用的是VARCHAR而不是INT。';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'sduonline_lantern_festival_2021'
--

--
-- Dumping routines for database 'sduonline_lantern_festival_2021'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-02-22 14:28:50
